Revit 2024 API
PointIterator Class
 A class used to iterate individual points in a PointCollection.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class PointIterator : IEnumerator<CloudPoint>
Visual Basic
Public Class PointIterator _
	Implements IEnumerator(Of CloudPoint)
Visual C++
public ref class PointIterator : IEnumerator<CloudPoint>
Remarks
 Points may be iterated in two different ways:
In the traditional IEnumerable interface, you can iterate the resulting points directly from the PointCollection.
In an unsafe interface usable only from C# and C++/CLI, you can get a pointer to the point storage of the collection and access the points directly in memory. Although you must deal with pointers directly, there may be performance improvements when traversing large buffers of points.
 Regardless of the approach used to obtain the points, the points are reported in the coordinate system of the point cloud. If you need the points in the coordinate system of the model, you will need to transform the point in those coordinates. The most direct way to do this is to obtain the transformation matrix from the PointCloudInstance (GetTransform()), convert the CloudPoint to an XYZ using the implicit conversion operator, and use Transform.OfPoint(XYZ).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.PointClouds.PointIterator
See Also
PointIterator Members
Autodesk.Revit.DB.PointClouds Namespace